      
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.vercel_project_directory.directory: Reading...
vercel_project.portfolio: Refreshing state... [id=prj_zT5vWIz9c1ApeyPf5hbnEYgLhxEX]
data.vercel_project_directory.directory: Read complete after 0s [id=../../../doppelgengar.dev]
vercel_project_domain.staging: Refreshing state... [id=staging.doppelgengar.dev]
vercel_project_domain.wwwstaging: Refreshing state... [id=www.staging.doppelgengar.dev]
vercel_deployment.deployment: Refreshing state... [id=dpl_9ZxHx1E9Rxg4v98DWKbqtBQSdt5z]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # vercel_deployment.deployment must be replaced
-/+ resource "vercel_deployment" "deployment" {
      ~ domains     = [] # forces replacement -> (known after apply) # forces replacement
      ~ files       = { # forces replacement
          ~ "../../../doppelgengar.dev/app/layout.tsx"                   = "679~57ce88f68807fe613eae29b5830e923ab49c9397" -> "679~b5aaaf0276cec0f784a81566e91b281036eb983f"
          ~ "../../../doppelgengar.dev/app/page.tsx"                     = "355~b1597bc4aa707c703b417961e4ce210a24240d72" -> "355~ad3f713d3484d06533ecc4c53bcb3b94bc3ba2d8"
          ~ "../../../doppelgengar.dev/app/ui/navigation/nav-header.tsx" = "343~75ee28bb4512e778935a149aa75bf3c1ebc07bf8" -> "343~fdfc74a0f8025fc6d3303f06d324c9aa802e66d8"
          ~ "../../../doppelgengar.dev/app/ui/navigation/nav-link.tsx"   = "920~4ce8828f034087f6db2dca1386af8b6ae7327a68" -> "1115~52ca5731e3a629d787ddadf55c6607106dd62254"
          ~ "../../../doppelgengar.dev/app/ui/styles/globals.css"        = "399~8fa2b18e2d50be02b9f26e48efd5daddeb2b6166" -> "399~b8386d67b992af346512b1128c1e477a9fb7ce5c"
          ~ "../../../doppelgengar.dev/package.json"                     = "811~20f64b1d1fc0cb82ea9a9a10c613322d31df3c67" -> "811~9952dfcc2dd2bed3b49534567ea01ca65aaefa33"
            # (7 unchanged elements hidden)
        }
      ~ id          = "dpl_9ZxHx1E9Rxg4v98DWKbqtBQSdt5z" -> (known after apply)
      + team_id     = (known after apply)
      ~ url         = "staging-doppelgengar-portfolio-gkrmigaew-kyle-moreiras-projects.vercel.app" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @DoppelG3ngar, Action: `pull_request`, Working Directory: `./terraform/environments/staging`, Workflow: `Pull request from feature branch`*